### Terraform Plan 📖
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_eks_cluster.example will be created
  + resource "aws_eks_cluster" "example" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "my-eks-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags_all                      = (known after apply)
      + version                       = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.example will be created
  + resource "aws_eks_node_group" "example" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "my-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "example-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::054183072250:role/eks-node-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }
    }

  # aws_iam_role.eks_cluster_role will be destroyed
  # (because aws_iam_role.eks_cluster_role is not in configuration)
  - resource "aws_iam_role" "eks_cluster_role" {
      - arn                   = "arn:aws:iam::054183072250:role/eks-cluster-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-03-30T02:28:45Z" -> null
      - force_detach_policies = false -> null
      - id                    = "eks-cluster-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "eks-cluster-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQZHMQCH5DB7MGOMTH" -> null
    }

  # aws_iam_role.eks_node_role will be updated in-place
  ~ resource "aws_iam_role" "eks_node_role" {
        id                    = "eks-node-role"
        name                  = "eks-node-role"
      ~ tags                  = {
          + "Name" = "eks-node-role"
        }
      ~ tags_all              = {
          + "Name" = "eks-node-role"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.eks_service_role will be created
  + resource "aws_iam_role" "eks_service_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-service-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "eks-service-role"
        }
      + tags_all              = {
          + "Name" = "eks-service-role"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_cluster_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      - id         = "eks-cluster-role-20250330022846727600000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "eks-cluster-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_cni_policy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_cni_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      - id         = "eks-node-role-20250330022846532100000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "eks-node-role" -> null
    }

  # aws_iam_role_policy_attachment.eks_node_logging_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_logging_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "eks-node-role"
    }

  # aws_iam_role_policy_attachment.eks_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-role"
    }

  # aws_iam_role_policy_attachment.eks_service_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_service_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-service-role"
    }

  # aws_iam_role_policy_attachment.eks_worker_node_policy will be destroyed
  # (because aws_iam_role_policy_attachment.eks_worker_node_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      - id         = "eks-node-role-20250330022846515100000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "eks-node-role" -> null
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_route_table.rt will be created
  + resource "aws_route_table" "rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.a will be created
  + resource "aws_route_table_association" "a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private_subnet_1 will be destroyed
  # (because aws_subnet.private_subnet_1 is not in configuration)
  - resource "aws_subnet" "private_subnet_1" {
      - arn                                            = "arn:aws:ec2:us-west-2:054183072250:subnet/subnet-05b1d12cc07f1e4ab" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-05b1d12cc07f1e4ab" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "054183072250" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "eks-private-subnet-1"
        } -> null
      - tags_all                                       = {
          - "Name" = "eks-private-subnet-1"
        } -> null
      - vpc_id                                         = "vpc-050f3307b29b46850" -> null
    }

  # aws_subnet.public_subnet_1 will be destroyed
  # (because aws_subnet.public_subnet_1 is not in configuration)
  - resource "aws_subnet" "public_subnet_1" {
      - arn                                            = "arn:aws:ec2:us-west-2:054183072250:subnet/subnet-0095ad040694a5b49" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0095ad040694a5b49" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "054183072250" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "eks-public-subnet-1"
        } -> null
      - tags_all                                       = {
          - "Name" = "eks-public-subnet-1"
        } -> null
      - vpc_id                                         = "vpc-050f3307b29b46850" -> null
    }

  # aws_subnet.subnet_private will be created
  + resource "aws_subnet" "subnet_private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private-subnet"
        }
      + tags_all                                       = {
          + "Name" = "private-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_public will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-subnet"
        }
      + tags_all                                       = {
          + "Name" = "public-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.eks_vpc will be destroyed
  # (because aws_vpc.eks_vpc is not in configuration)
  - resource "aws_vpc" "eks_vpc" {
      - arn                                  = "arn:aws:ec2:us-west-2:054183072250:vpc/vpc-050f3307b29b46850" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0a20eea4fdb993dba" -> null
      - default_route_table_id               = "rtb-0fee42b3071ee8fc7" -> null
      - default_security_group_id            = "sg-09e14d9163fc94dfd" -> null
      - dhcp_options_id                      = "dopt-07a92862793f877ff" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-050f3307b29b46850" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0fee42b3071ee8fc7" -> null
      - owner_id                             = "054183072250" -> null
      - tags                                 = {
          - "Name" = "eks-vpc"
        } -> null
      - tags_all                             = {
          - "Name" = "eks-vpc"
        } -> null
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "main-vpc"
        }
      + tags_all                             = {
          + "Name" = "main-vpc"
        }
    }

Plan: 12 to add, 1 to change, 7 to destroy.
```